#include <iostream>
#include "Queue.h"

int main() {
    // Створення двох черг
    Queue q1({2, 3, 5});
    Queue q2({1, 4, 6});

    // Виведення початкових добутків елементів у чергах
    std::cout << "Добуток елементів q1: " << q1.product() << std::endl;
    std::cout << "Добуток елементів q2: " << q2.product() << std::endl;

    // Порівняння черг за добутками
    if (q1 <= q2) {
        std::cout << "q1 має менший або рівний добуток, ніж q2" << std::endl;
    } else {
        std::cout << "q1 має більший добуток, ніж q2" << std::endl;
    }

    // Додавання елементів з q2 до q1
    q1 += q2;

    // Виведення результату після додавання
    std::cout << "q1 після додавання елементів з q2: ";
    q1.print();

    // Обчислення нового добутку після додавання елементів
    std::cout << "Новий добуток елементів q1: " << q1.product() << std::endl;

    return 0;
}
